## Staging: alb
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                RESOURCE                |
|----------|----------------------------------------|
| update   | `aws_lb_listener.blawx_https_listener` |
| recreate | `aws_lb_target_group.blawx_app`        |

| CHANGE |       OUTPUT       |
|--------|--------------------|
| update | `target_group_arn` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb_listener.blawx_https_listener will be updated in-place
  ~ resource "aws_lb_listener" "blawx_https_listener" {
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:listener/app/blawx-staging-alb/6dd3dfb45bd30fe6/f1db08df1b27e0e8"
        tags                                                                  = {
            "CostCentre" = "blawx-staging"
            "Name"       = "blawx-staging-https-listener"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.blawx_app must be replaced
+/- resource "aws_lb_target_group" "blawx_app" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/blawx-staging-app-tg/c9ae7767df34d77b" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:278626299035:loadbalancer/app/blawx-staging-alb/6dd3dfb45bd30fe6",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "blawx-staging-app-tg"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "CostCentre" = "blawx-staging"
            "Name"       = "blawx-staging-app-target-group"
            "Terraform"  = "true"
        }
      ~ target_type                        = "instance" -> "ip" # forces replacement
        # (9 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ target_group_arn      = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.blawx_certificate"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
